Repository: marnen/hive
Catalog: lib/ruby/gettext/po/*/rgettext.po
Languages: es

source: Failed to merge with %{defpo}
es: Fallo al unir con %{defpo}

source: New .pot was copied to %{failed_filename}
es: Nuevo .pot se ha copiado en %{failed_filename}

source: Check these po/pot-files. It may have syntax errors or something wrong.
es: Chequee estos ficheros po/pot. Pueden tener errores

source: 3rd parmeter is wrong: value = %{number}
es: tercer parámetro es erróneo: valor = %{número}

source: '%{klass}' is ignored.
es: '%{klass}' ignorado

source: Usage: %s input.rb [-r parser.rb] [-o output.pot]
es: Uso: %s entrada.po [-r parser.rb] [-o salida.pot]

source: Extract translatable strings from given input files.
es: Extraer las cadenas traducibles de los ficheros de entrada.

source: Specific options:
es: Opciones específicas:

source: write output to specified file
es: escribir salida en fichero especificado

source: File '%s' already exists.
es: El fichero '%s' ya ha existido

source: require the library before executing rgettext
es: importe la biblioteca antes de ejecutar rgettext

source: run in debugging mode
es: ejecute en modo depuración

source: display version information and exit
es: mostrar información de versión y salir

source: no input files
es: no hay ficheros de entrada

source: Usage: %s input.po [-o output.mo]
es: Uso: %s entrada.po [-o salida.mo]

source: Generate binary message catalog from textual translation description.
es: Generar catálogo de mensajes binarios a partir de la descripción textual de la traducción.

source: Usage: %s def.po ref.pot [-o output.pot]
es: Uso: %s def.po ref.pot [-o salida.pot]

source: Merges two Uniforum style .po files together. The def.po file is an existing PO file with translations. The ref.pot file is the last created PO file with up-to-date source references. ref.pot is generally created by rgettext.
es: Combina dos ficheros .po de estilo Uniforum juntos. El fichero def.po es un fichero PO existente con traducciones. El fichero ref.pot es el último fichero PO con referencias actualizadas. ref.pot generalmente es creado por rgettext.

source: definition po is not given.
es: no se ha dado definición po

source: reference pot is not given.
es: no se ha dado referencia pot

source: `%{file}' is not glade-2.0 format.
es: `%{file}' no tiene formato glade-2.0.

source: Warning: fuzzy message was ignored.
es: Aviso: se ha ignorado mensaje ambigüo.

source: Warning: obsolete msgid exists.
es: Aviso: existe msgid obsoleto.
